[{"title":"Working memory intervention","status":"Ongoing","description":"A working-memory intervention was designed to complement the UNWR toolkit (Howell et. al. 2017). An intervention was designed to improve only fluency and not word-finding ability in children at high-risk of fluency problems and phonological skills in all children (children with English as an Additional Language as well as those who speak English alone). ","publications":"Peter Howell, Li Ying Chua, Kaho Yoshikawa, Hannah Tang, John Harris & Kevin Tang. Submitted. A working-memory intervention for reception-class children who have fluency difficulty.","project-page":null,"tool-availability":"Coming soon"},{"title":"Word-finding difficulty intervention","status":"Ongoing","description":"A word-finding difficulty intervention was designed to complement the UNWR toolkit (Howell et. al. 2017). Children who were identified as having word-finding difficulty were given phonological training that taught them features of English that they lacked (this depended on their language background). Then they received semantic training. It was found that this training improved a range of outcome measures related to education.","publications":"Peter Howell, Kaho Yoshikawa, Kevin Tang, John Harris & Clarissa Sorger. 2017. Intervention for word-finding difficulty for children starting school who have diverse language backgrounds. In Robert Eklund & Ralph Rose (ed.), Proceedings of Disfluencies in Spontaneous Speech, 8th workshop, vol. 58, 33–36. Stockholm, Sweden: KTH Royal Institute of Technology, TMH-QPSR http:\/\/discovery.ucl.ac.uk\/1569612\/","project-page":null,"tool-availability":"Coming soon"},{"title":"UNWR (Universal Non-Word Repetition)","status":"Completed","description":"A non-word repetition test (UNWR), applicable across 20 languages, that was validated by comparing groups of children identified by their speech and language symptoms as having either stuttering or WFD.","publications":"Peter Howell, Kevin Tang, Outi Tuomainen, Sin Kan Chan, Kirsten Beltran, Avin Mirawdeli & John Harris.  2017.  Identification of fluency and word-finding difficulty in samples of children with diverse language backgrounds. International Journal of Language & Communication Disorders 52(5). 595-611. http:\/\/dx.doi.org\/10.1111\/1460-6984.12305\n","project-page":null,"tool-availability":"Yes"}]